Revit 2024 API
AssetPropertyDistance.GetUnitTypeId Method
 Gets the identifier of the unit quantifying the distance property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ForgeTypeId GetUnitTypeId()
Visual Basic
Public Function GetUnitTypeId As ForgeTypeId
Visual C++
public:
ForgeTypeId^ GetUnitTypeId()
See Also
AssetPropertyDistance Class
Autodesk.Revit.DB.Visual Namespace